#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	int a[3][4] = { 0 };
	printf("%d\n", sizeof(a));//计算的是整个二维数组的大小，单位是字节—48

	printf("%d\n", sizeof(a[0][0]));//a[0][0]-第一个元素的大小，大小是4个字节

	printf("%d\n", sizeof(a[0]));//16 - a[0]其实是第一行的数组名，这里第一行的数组名单独放在sizeof内部了，计算的是第一行的大小

	printf("%d\n", sizeof(a[0] + 1));//
	//a[0]是第一行这个数组的数组名，但是数组名并没有单独放在sizeof内部，所以数组名表示数组首元素的地址，也就是a[0][0]的地址，a[0] + 1是第一行第二个元素（a[0][1]）的地址

	printf("%d\n", sizeof(*(a[0] + 1)));//a[0] + 1是第一行第二个元素（a[0][1]）的地址
	//*(a[0] + 1)是第一行第二个元素，大小是4个字节

	printf("%d\n", sizeof(a + 1));//a是二维数组的数组名，没有单独放在sizeof的内部，所以a就是数组首元素的地址，也就是第一行的地址
	//a + 1就是第二行的地址
	//a -- int (*)[4]
	//a + 1 -- int (*)[4]

	printf("%d\n", sizeof(*(a + 1)));//16 --> *(a + 1) == a[1]


	printf("%d\n", sizeof(&a[0] + 1));//第二行的地址，是地址大小就是4/8个字节
	//a[0]是第一行的数组名，&a[0]取出的是第一行的地址，&a[0] + 1得到的就是第二行的地址

	printf("%d\n", sizeof(*(&a[0] + 1)));//16

	printf("%d\n", sizeof(*a));//16—数组名a就是数组首元素的地址，也就是第一行的地址，*a就是第一行的大小
	//*a == *(a + 0) == a[0]

	printf("%d\n", sizeof(a[3]));//16
	//arr[3] == arr[0]
	return 0;
}