#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//1.翻译环境和运行环境
//翻译环境 —> 源代码转换成可执行的机器指令 —> 编译和链接 
//执行代码 —> 实际执行代码
//
//2.翻译环境：编译和链接两大过程
//编译分为三个过程：预处理（预编译）、编译、汇编
//
//⼀个C语⾔的项⽬中可能有多个.c⽂件⼀起构建，那多个.c⽂件如何⽣成可执⾏程序呢？
//1、多个.c⽂件单独经过编译出编译处理⽣产对应的⽬标⽂件（注：在Windows环境下的⽬标⽂件的后缀是.obj，Linux环境下⽬标⽂件的后缀是.o）。
//2、多个⽬标⽂件和链接库⼀起经过链接器处理⽣成最终的可执⾏程序（链接库是指运⾏时库(它是⽀持程序运⾏的基本函数集合)或者第三⽅库）。

//int main()
//{
//	printf("%d\n", 100);
//
//	return 0;
//}
//win:
//目标文件的后缀是.obj
//目标文件的后缀是.obj
//可执行文件的后缀是.exe
//
//Linux:
//目标文件的后缀是.obj
//可执行文件的后缀是.exe


extern add(int x, int y);

int main()
{
	printf("%d\n", add(2, 3));

	return 0;
}
