#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	int a[4] = { 1, 2, 3, 4 };

	int *ptr1 = (int *)(&a + 1);

	int *ptr2 = (int *)((int)a + 1);
	
	printf("%x, %x", ptr1[-1], *ptr2);
	//ptr1[-1] --> *(ptr1 - 1) --> 4
	
	//假设0x0012ff40是a的地址 --> 强制转换成int类型 --> +1 --> 1244992 + 1 --> 1244993 --> 强转成(int*)0x0012ff41，即加了1个字节
	//假设数组在内存中是以以下形式存储的：
	//1：0x 00 00 00 01
	//2：0x 00 00 00 02
	//3：0x 00 00 00 03
	//4：0x 00 00 00 04
	//小端：
	//01 00 00 00 02 00 00 00 03 00 00 00 04 00 00 00
	//+1之后，为00 00 00 02
	//小端排序：0x 02 00 00 00 --> 2
	return 0;
}