#define _CRT_SECURE_NO_WARNINGS

//1. 为什么要使用文件？
//数据------>内存中  程序退出、掉电  数据就丢失了
//数据------>硬盘 其实就是存储在文件中，数据就不会因为程序退出、掉电就丢失
//想要数据持久化，就需要存储到文件中！

//2. 什么是文件？
//一般来说，磁盘（硬盘）上的文件就是文件。
//但是在程序设计中，我们一般谈的文件有两种：程序文件、数据文件（从文件的功能角度来分类）

//2.1 程序文件
//包含源程序文件（后缀为.c），目标文件（Windows环境后缀为.obj），可执行程序（Windows环境后缀为。exe）
//举例：
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//
////程序文件
//int main()
//{
//	printf("hehe\n");
//	return 0;
//}

//2.2 数据文件
//在以前各章所处理数据的输⼊输出都是以终端为对象的，即从终端的键盘输⼊数据，运⾏结果显⽰到显⽰器上。
//其实有时候我们会把信息输出到磁盘上，当需要的时候再从磁盘上把数据读取到内存中使⽤，这⾥处理的就是磁盘上⽂件。

//2.3 文件名
//一个文件要有一个唯一的文件标识，以便用户识别和引用
//文件名包括3部分：文件路径 + 文件名主干 + 文件后缀
//例如：c : \code\test.txt
//为了方便起见，文件标识常被称为文件名。

//3. 二进制文件和文本文件
//根据数据的组织形式，数据文件被称为文本文件或者二进制文件

//简单理解：
//文本文件：储存文本信息的文件
//储存二进制信息的文件

//举例：
#include <stdio.h>
//int main()
//{
//	int a = 10000;
//	
//	FILE* pf = fopen("test.txt", "wb");
//	fwrite(&a, 4, 1, pf);//⼆进制的形式写到⽂件中
//	fclose(pf);
//	pf = NULL;
//	
//	return 0;
//}

//如果test.txt文件不存在，C语言会在该路径下创建该文件，即在“test-2023-11-8”文件夹中创建test.txt文件

//test.txt文件用记事本打开以后看不懂，“源文件 ---> 添加现有项 ---> test.txt ---> 打开方式 ---> 二进制编辑器”

//4. 文件的打开和关闭

//文件的打开和关闭，我们可以理解为给瓶子中灌水：
//（1）打开罐子（打开文件）
//（2）灌水（读/写文件）
//（3）盖上盖子（关闭文件）

//4.1 流和标准流

//4.1.1 流的概念
//流是高度抽象的概念，可以理解为流淌着字符的河，通过流我们可以将数据打印到屏幕、写入硬盘等，C语言程序员只需要将考虑如何将数据写入流中即可，不用关心外部设备是啥，效率就会大大提高

//4.1.2 标准流
//C语言中有很多流，而在C语言启动的时候，默认打开了三个流：
//stdin—标准输入流，在大多数环境中从键盘输入，scanf函数就是从标准输入流中读取数据。
//stdout—标准输出流，大多数环境中输出至显示器界面，printf函数就是将信息输出到标准输出流中。
//stderr—标准错误流，大多数环境中输出到显示器界面

//stdin、stdout、stderr三个流的类型是：FILE* ，通常称为文件指针
//C语言中，通过FILE*来维护流的各种操作

//4.2 文件指针
//缓冲文件系统中，关键的概念是“文件类型指针”，简称“文件指针”

//使用文件，打开文件 ----》 内存中创建一个和这个文件相关的文件信息去区 ----》 这个文件信息区是由FILE类型的结构体来描述的

//int main()
//{
//	FILE;
//	return 0;
//}

//4.3 文件的打开和关闭
//fopen函数来打开文件，fclose来关闭文件

//fopen有以下几种打开方式：
//（1）“r”：文件必须存在，如果不存在，则打开失败
//fopen函数打开失败的话，会返回NULL；如果打开成功，会返回文件信息区的地址FILE*（文件地址）

//（2）“w”：写文件，如果文件存在，会清空原来文件的内容，相当于变成了空文件夹
//                    如果文件不存在，会新建一个空文件

int main()
{
	//打开文件
	FILE* pf = fopen("test.txt", "w");

	//FILE* pf = fopen("D:\C语言项目\test-2023-11-8\test-2023-11-6\test.txt", "w");
	//绝对路径

	//相对路径
	//.表示路径
	//..上一级路径
	//FILE* pf = fopen("../../test-2023-11-8/test.txt", "w");

	if (pf == NULL)
	{
		perror("fopen");
		return 1;
	}
	//写文件
	fputc('x', pf);
	fputc('y', pf);
	fputc('z', pf);


	//关闭文件
	fclose(pf);
	pf = NULL;

	return 0;
}
