//1. 为什么要使用文件？
//数据------>内存中  程序退出、掉电  数据就丢失了
//数据------>硬盘 其实就是存储在文件中，数据就不会因为程序退出、掉电就丢失
//想要数据持久化，就需要存储到文件中！

//2. 什么是文件？
//一般来说，磁盘（硬盘）上的文件就是文件。
//但是在程序设计中，我们一般谈的文件有两种：程序文件、数据文件（从文件的功能角度来分类）

//2.1 程序文件
//包含源程序文件（后缀为.c），目标文件（Windows环境后缀为.obj），可执行程序（Windows环境后缀为。exe）
//举例：
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//程序文件
int main()
{
	printf("hehe\n");
	return 0;
}

//2.2 数据文件
//在以前各章所处理数据的输⼊输出都是以终端为对象的，即从终端的键盘输⼊数据，运⾏结果显⽰到显⽰器上。
//其实有时候我们会把信息输出到磁盘上，当需要的时候再从磁盘上把数据读取到内存中使⽤，这⾥处理的就是磁盘上⽂件。

//2.3 文件名
//一个文件要有一个唯一的文件标识，以便用户识别和引用
//文件名包括3部分：文件路径 + 文件名主干 + 文件后缀
//例如：c : \code\test.txt
//为了方便起见，文件标识常被称为文件名。
